angular.module('starter.controllers', [])

.controller('AppCtrl', function($scope, $ionicModal, $timeout) {

  // With the new view caching in Ionic, Controllers are only called
  // when they are recreated or on app start, instead of every page change.
  // To listen for when this page is active (for example, to refresh data),
  // listen for the $ionicView.enter event:
  //$scope.$on('$ionicView.enter', function(e) {
  //});
   $scope.openSub = function(name) {
    $scope.submenu = true;
    $scope.selection = 'sub';
  }
  $scope.backToMain = function() {
    $scope.submenu = false;
    $scope.selection = 'main';
  }
  // Form data for the login modal
  $scope.loginData = {};

  // Create the login modal that we will use later
  $ionicModal.fromTemplateUrl('templates/login.html', {
    scope: $scope
  }).then(function(modal) {
    $scope.modal = modal;
  });

  // Triggered in the login modal to close it
  $scope.closeLogin = function() {
    $scope.modal.hide();
  };

  // Open the login modal
  $scope.login = function() {
    $scope.modal.show();
  };

  // Perform the login action when the user submits the login form
  $scope.doLogin = function() {
    console.log('Doing login', $scope.loginData);

    // Simulate a login delay. Remove this and replace with your login
    // code if using a login system
    $timeout(function() {
      $scope.closeLogin();
    }, 1000);
  };
})

.controller('ShlokController', ['$scope', '$ionicGesture', '$stateParams','dataFactory','shlokService', function($scope, $ionicGesture, $stateParams, dataFactory, shlokService) {
  $scope.shlokNumber = 1;
  $scope.shlok = "";
  $scope.shlokImage = "";
  $scope.imgCount = dataFactory.getImageCount($stateParams.name);
  // shlokService.getShlok($stateParams.name);
  // $scope.title = dataFactory.getTitle($stateParams.name);
  // $scope.length = dataFactory.getNumberofShloks($stateParams.name);
  dataFactory.getShlokInfo($stateParams.name).then(function(done) {
    $scope.title = dataFactory.getTitle($stateParams.name);
    $scope.length = dataFactory.getNumberofShloks($stateParams.name);

    loadShlok();
  })
  //alert($stateParams.name);
  // for now specific
  function changeImage() {
    var number = parseInt(Math.random() * 10 % $scope.imgCount) + 1;
    $scope.shlokImage = "./img/" + $stateParams.name+"/"+number + ".jpg";
  }

  var element = angular.element(document.querySelector('#view'));
  function loadShlok() {
     changeImage()
     $scope.shlok = dataFactory.getShlok($stateParams.name,$scope.shlokNumber);
  }

  $scope.loadNext = function() {
    $scope.shlokNumber++;
    loadShlok();
  }

  $scope.loadPrevious = function () {
    $scope.shlokNumber--;
    loadShlok();
  }


}])
.service('shlokService', ['$http' , '$q', function($http, $q){
  this.getShlok = function(name){
    var deferred = $q.defer();

    $http({
      method:'GET',
      url : 'http://localhost:3000/bhakti/'+name
    }).then(function success(res){
     // alert(JSON.stringify(res.data));
      deferred.resolve(res.data);
    }, function err(res) {
      alert(res);
      deferred.reject(res);
    });

    return deferred.promise;
  }
}])
.factory('dataFactory', ['$q', 'shlokService', function($q, shlokService) {
  var data = {
    haripath: {
      name: "haripath",
      title: "हरी पाठ",
      shlok: [
        "श्री गणॆशाय नमः १  दॆवाचियॆ द्वारीं उभा क्षणभरी . तॆणॆं मुक्ति चारी साधियॆल्या .. १.. हरि मुखॆं म्हणा हरि मुखॆं म्हणा . पुण्याची गणना कॊण करी .. २.. असॊनि संसारीं जिव्हॆ वॆगु करी . वॆदशास्त्र उभारी बाह्या सदा .. ३.. ज्ञानदॆव म्हणॆ व्यासाचिया खुणा . द्वारकॆचा राणा पांडवां घरीं .. ४.. ",
        " २ चहूं वॆदीं जाण षट्‌शास्त्रीं कारण . अठराहीं पुराणॆं हरीसी गाती .. १.. मंथुनी नवनीता तैसॆं घॆ अनंता . वायां व्यर्थ कथा सांडी मार्ग .. २.. ऎक हरि आत्मा जीवशिव सम . वायां दुर्गमी न घालीं मन .. ३.. ज्ञानदॆवा पाठ हरि हा वैकुंठ . भरला घनदाट हरि दिसॆ .. ४.. ",
        " ३ त्रिगुण असार निर्गुण हॆं सार . सारासार विचार हरिपाठ .. १.. सगुण निर्गुण गुणांचॆं अगुण . हरिविणॆं मत व्यर्थ जाय .. २.. अव्यक्त निराकार राहीं ज्या आकार . जॆथुनी चराचर त्यासी भजॆं .. ३.. ज्ञानदॆवा ध्यानीं रामकृष्ण मनीं . अनंत जन्मांनीं पुण्य हॊय .. ४ .. ",
        " ४ भावॆंवीण भक्ति भक्तिवीण मुक्ति . बळॆंवीण शक्ति बॊलूं नयॆ .. १.. कैसॆनि दैवत प्रसन्न त्वरित . उगा राहॆं निवांत शिणसी वायां .. १.. सायासॆं करिसी प्रपञ्च दिननिशीं . हरिसी न भजसी कॊण्या गुणॆ .. ३.. ज्ञानदॆव म्हणॆ हरिजप करणॆं . तुटॆल धरणॆं प्रपंचाचॆं .. ४.. ",
        " ५ यॊग याग विधी यॆणॆं नॊहॆ सिद्धि . वायांचि उपाधि दंभधर्म .. १.. भावॆंवीण दॆव न कळॆ निःसंदॆह . गुरुवीण अनुभव कैसा कळॆ .. २.. तपॆवीण दैवत दिधल्यावीण प्राप्त . गुजॆवीण हित कॊण सांगॆ .. ३.. ज्ञानदॆव मार्ग दृष्टांताची मात . साधूचॆ संगती तरुणॊपाय .. ४.. ",
        " ६ साधुबॊध झाला तॊ नुरॊनियां ठॆला . ठायींच मुराला अनुभवॆं .. १.. कापुराची वाती उजळली ज्यॊती . ठायींच समाप्ती झाली जैसी .. २.. मॊक्षरॆखॆं आला भाग्यॆ विनटला . साधूचा अंकिला हरिभक्त .. ३.. ज्ञानदॆवा गॊडी संगती सज्जनीं . हरि दिसॆ जनीं आत्मतत्त्वीं .. ४.. ",
        " ७ पर्वताप्रमाणॆं पातक करणॆं . वज्रलॆप हॊणॆं अभक्तांसी .. १.. नाहीं ज्यांसी भक्ति तॆ पतित अभक्त . हरीसी न भजत दैवहत .. २.. अनंत वाचाळ बरळती बरळ . त्यां कैंचा दयाळ पावॆ हरी .. ३.. ज्ञानदॆवा प्रमाण आत्मा हा निधान . सर्वांघटीं पूर्ण ऎक नांदॆ .. ४.. ",
        " ८ संतांचॆ संगती मनॊमार्गगती . आकळावा श्रीपति यॆणॆं पंथॆं .. १.. रामकृष्ण वाचा भाव हा जीवाचा . आत्मा जॊ शिवाचा राम जप .. २.. ऎकतत्त्वी नाम साधिती साधन . द्वैताचॆं बंधन न बाधिजॆ .. ३.. नामामृत गॊडी वैष्णवां लाधली . यॊगियां साधली जीवनकळा .. ४.. सत्वर उच्चार प्रल्हादी बिंबला . उद्धवा लाधला कृष्णदाता .. ५.. ज्ञानदॆव म्हणॆ नाम हॆं सुलभ . सर्वत्र दुर्लभ विरळा जाणॆ .. ६.. ",
        " ९ विष्णुविणॆं जप व्यर्थ त्याचॆं ज्ञान . रामकृष्णीं मन नाहीं ज्याचॆ .. १.. उपजॊनी करंटा नॆणॆं अद्वय वाटा . रामकृष्णीं पैठा कैसा हॊय .. २.. द्वैताची झाडणी गुरुविण ज्ञान . त्या कैंचॆं कीर्तन घडॆ नामीं .. ३.. ज्ञानदॆव म्हणॆ सगुण हॆं ध्यान . नामपाठ मौन प्रपंचाचॆं .. ४.. ",
        " १० त्रिवॆणीसंगमीं नाना तीर्थॆं भ्रमीं . चित्त नाहीं नामीं तरी तॆ व्यर्थ .. १.. नामासी विन्मुख तॊ नर पापिया . हरीविण धांवया न पावॆ कॊणी .. २.. पुराणप्रसिद्ध बॊलिलॆ वाल्मिक . नामॆं तिन्ही लॊक उद्धरती .. ३.. ज्ञानदॆव म्हणॆ नाम जपा हरिचॆं . परंपरा त्याचॆं कुळ शुद्ध .. ४.. ",
        " ११ हरि{उ}च्चारणीं अनंत पापराशी . जातील लय्आसी क्षणमात्रॆं .. १.. तृण अग्निमॆळॆं समरस झालॆं . तैसॆं नामॆं कॆलॆं जपता हरी .. २.. हरि{उ}च्चारण मंत्र पैं अगाध . पळॆ भूतबाधा भय याचॆं .. ३.. ज्ञानदॆव म्हणॆ हरि माझा समर्थ . न करवॆ अर्थ उपनिषदां .. ४.. ",
        " १२ तीर्थ व्रत नॆम भावॆवीण सिद्धी . वायांची उपाधी करिसी जनां .. १.. भावबळॆं आकळॆ यॆरवी नाकळॆ . करतळीं आंवळॆ तैसा हरी .. २.. पारियाचा रवा घॆतां भूमीवरी . यत्न परॊपरी साधन तैसॆं .. ३.. ज्ञानदॆव म्हणॆ निवृत्ति निर्गुण . दिधलॆं संपूर्ण माझॆ हातीं .. ४.. ",
        " १३ समाधि हरीची सम सुखॆंवीण . न साधॆल जाण द्वैतबुद्धि .. १.. बुद्धीचॆं वैभव अन्य नाहीं दुजॆं . ऎका कॆशवराजॆ सकळ सिद्धि .. २.. ऋद्धि सिद्धि अन्य निधि अवघीच उपाधी . जंव त्या परमानंदी मन नाहीं .. ३.. ज्ञानदॆवीं रम्य रमलॆं समाधान . हरीचॆं चिंतन सर्वकाळ .. ४.. ",
        " १४ नित्य सत्य मित हरिपाठ ज्यासी . कळिकाळ त्यासी न पाहॆ दृष्टी .. १.. रामकृष्णीं वाचा अनंतराशी तप . पापाचॆ कळप पळती पुढॆं .. २.. हरि हरि हरि मंत्र हा शिवाचा . म्हणती जॆ वाचा तया मॊक्ष .. ३.. ज्ञानदॆवा पाठ नारायण नाम . पाविजॆ उत्तम निज स्थान .. ४.. ",
        " १५ ऎक नाम हरि द्वैतनाम दूरी . अद्वैत कुसरी विरळा जाणॆ .. १.. समबुद्धि घॆतां समान श्रीहरी . शमदमां वरी हरि झाला .. २.. सर्वांघटी राम दॆहादॆहीं ऎक . सूर्य प्रकाशक सहस्ररश्मी .. ३.. ज्ञानदॆवा चित्तीं हरिपाठ नॆमा . मागिलिया जन्मा मुक्त झालॊं .. ४.. ",
        " १६ हरिनाम जपॆ तॊ नर दुर्लभ . वाचॆसी सुलभ राम कृष्ण .. १.. राम कृष्ण नामीं उन्मनी साधली . तयासी लाधली सकळ सिद्धि .. २.. सिद्धि बुद्धि धर्म हरिपाठीं आलॆ . प्रपंची निमालॆ साधुसंगॆ .. ३.. ज्ञानदॆवीं नाम रामकृष्ण ठसा . तॆणॆं दशदिशा आत्माराम .. ४.. ",
        " १७ हरिपाठकीर्ति मुखॆं जरी गाय . पवित्रचि हॊय दॆह त्याचा .. १.. तपाचॆ सामर्थ्यॆ तपिन्नला अमूप . चिरंजीव कल्प वैकुंठीं नांदॆ .. २.. मतृपितृभ्रात सगॊत्र अपार . चतुर्भुज नर हॊ{ऊ}नि ठॆलॆ .. ३.. ज्ञान गूढगम्य ज्ञानदॆवा लाधलॆं . निवृत्तीनॆं दिधलॆं माझॆं हातीं .. ४.. ",
        " १८ हरिवंशपुराण हरिनाम संकीर्तन . हरिविण सौजन्य नॆणॆ कॊणी .. १.. त्या नरा लाधलॆं वैकुंठ जॊडलॆं . सकळही घडलॆं तीर्थाटण .. २.. मनॊमार्गॆं गॆला तॊ तॆथॆं मुकला . हरिपाठीं स्थिरावला तॊचि धन्य .. ३.. ज्ञानदॆवा गॊडी हरिनामाची जॊडी . रामकृष्णी आवडी सर्वकाळ .. ४.. ",
        " १९ नामसंकीर्तन वैष्णवांची जॊडी . पापॆं अनंत कॊटी गॆलीं त्यांची .. १.. अनंत जन्मांचॆं तप ऎक नाम . सर्व मार्ग सुगम हरिपाठी .. २.. यॊग याग क्रिया धर्माधर्म माया . गॆलॆ तॆ विलया हरिपाठी .. ३.. ज्ञानदॆवी यज्ञयाग क्रिया धर्म . हरीविण नॆम नाहीं दुजा .. ४.. ",
        " २० वॆदशास्त्रपुराण श्रुतीचॆं वचन . ऎक नारायण सारा जप .. १.. जप तप कर्म हरीविण धर्म . वा{उ}गाचि श्रम व्यर्थ जाय .. २.. हरीपाठी गॆलॆ तॆ निवांताचि ठॆलॆ . भ्रमर गुंतलॆ सुमनकळिकॆ .. ३.. ज्ञानदॆवीं मंत्र हरिनामाचॆं शस्त्र . यमॆं कुळगॊत्र वर्जियॆलॆं .. ४.. ",
        " २१ काळ वॆळ नाम उच्चारितां नाहीं . दॊन्ही पक्ष पाहीं उद्धरती .. १.. रामकृष्ण नाम सर्व दॊषां हरण . जडजीवां तारण हरि ऎक .. २.. हरिनाम सार जिव्हा या नामाची . उपमा त्या दॆवाची कॊण वानी .. ३.. ज्ञानदॆवा सांग झाला हरिपाठ . पूर्वजां वैकुंठ मार्ग सॊपा .. ४.. ",
        " २२ नित्यनॆम नामीं तॆ प्राणी दुर्लभ . लक्षुमीवल्लभ तयां जवळी .. १.. नारायण हरी नारायण हरी . भुक्ति मुक्ति चारी घरीं त्यांच्या .. २.. हरिविण जन्म नर्कचि पैं जाणा . यमाचा पाहुणा प्राणी हॊय .. ३.. ज्ञानदॆव पुसॆ निवृत्तिसी चाड . गगनाहूनि वाड नाम आहॆ .. ४.. ",
        " २३ सात पांच तीन दशकांचा मॆळा . ऎक तत्त्वी कळा दावी हरी .. १.. तैसॆं नव्हॆ नाम सर्वत्र वरिष्ठ . तॆथॆं कांहीं कष्ट न लागती .. २.. अजपा जपणॆं उलट प्राणाचा . यॆथॆंही मनाचा निर्धार असॆ .. ३.. ज्ञानदॆवा जिणॆं नामॆंविण व्यर्थ . रामकृष्णीं पंथ क्रमियॆला .. ४.. ",
        " २४ जप तप कर्म क्रिया नॆम धर्म . सर्वांघटीं राम भाव शुद्ध .. १.. न सॊडी हा भावॊ टाकी रॆ संदॆहॊ . रामकृष्ण टाहॊ नित्य फॊडी .. २.. जाति वित्त गॊत्र कुळ शीळ मात . भजकां त्वरित भावनायुक्त .. ३.. ज्ञानदॆव ध्यानीं रामकृष्ण मनीं . वैकुंठभुवनीं घर कॆलॆं .. ४.. ",
        " २५ जाणीव नॆणीव भगवंतीं नाही ं . हरि{उ}च्चारणी पाही मॊक्ष सदा .. १.. नारायण हरी उच्चार नामाचा . तॆथॆं कळिकाळाचा रीघ नाहीं .. २.. तॆथील प्रमाण नॆणवॆ वॆदांसी . तॆं जीवजंतूंसीं कॆवीं कळॆ .. ३.. ज्ञानदॆव फळ नारायण पाठ . सर्वत्र वैकुंठ कॆलॆं असॆ .. ४.. ",
        " २६ ऎक तत्त्व नाम दृढ धरीं मना . हरीसी करुणा यॆ{ई}ल तुझी .. १.. तॆं नाम सॊपॆं रॆ रामकृष्ण गॊविंद . वाचॆसी सद्गद जपॆ आधीं .. २.. नामापरतॆं तत्त्व नाहीं रॆ अन्यथा . वायां आणि पंथा जाशी झणी .. ३.. ज्ञानदॆव नाम जपमाळ अंतरी . धरॊनी श्रीहरी जपॆ सदा .. ४.. ",
        " २७ सर्व सुख गॊडी साही शास्त्रॆं निवडी . रिकामा अर्धघडी राहूं नकॊ .. १.. लटिका व्यवहार सर्व हा संसार . वायां यॆरझार हरीविण .. २.. नाममंत्र जप कॊटी जा{ई}ल पाप . रामकृष्णीं संकल्प धरूनी राहॆ .. ३.. निजवृत्ति हॆ काढी माया तॊडी . इंद्रियांसवडी लपूं नकॊ .. ४.. तीर्थीं व्रतीं भाव धरीं रॆ करुणा . शांति दया पाहुणा हरि करीं .. ५.. ",
        " २८ अभंग हरिपाठ असती अठ्ठावीस . रचिलॆ विश्वासॆं ज्ञानदॆवॆं .. १.. नित्य पाठ करी इंद्रायणीतीरीं . हॊय अधिकारी सर्वथा तॊ .. २.. असावॆं ऎकाग्रीं स्वस्थ चित्त मन . उल्हासॆं करून स्मरण जीवी .. ३.. अंतकाळीं तैसा संकटाचॆं वॆळीं . हरि तया सांभाळी अंतर्बाह्य .. ४.. संतसज्जनानीं घॆतली प्रचीती . आळशी मंदमती कॆवीं तरॆं .. ५.. श्रीगुरु निवृत्ति वचन प्रॆमळ . तॊषला तात्काळ ज्ञानदॆव .. ६.. ",
        " २९ कॊणाचॆं हॆं घर हा दॆह कॊणाचा . आत्माराम त्याचा तॊचि जाणॆ .. १.. मी तूं हा विचार विवॆक शॊधावा . गॊविंदा माधवा याच दॆहीं .. २.. दॆहीं ध्याता ध्यान त्रिपुटीवॆगळा . सहस्र दळीं उगवला सूर्य जैसा .. ३.. ज्ञानदॆव म्हणॆ नयनाची ज्यॊती . या नावॆं रूपॆं तुम्ही जाणा .. ४.."
      ]
    },
      atharv: {
        _id: "57d632c7787783101bb9437d",
          name: "atharv",
          title: "अथर्वशीर्ष",
          shlok: [
            "श्रीगणपति अथर्वशीर्षम् | श्री गणेशाय नमः । (शान्तिमन्त्राः) ॐ भद्रङ् कर्णेभिः शृणुयाम देवाः । भद्रम् पश्येमाक्षभिर्यजत्राः । स्थिरैरङ्गैस्तुष्टुवांसस्तनूभिः व्यशेम देवहितं यदायुः ।।",
            " ॐ स्वस्ति न इन्द्रो वृद्धश्रवाः । स्वस्ति नः पूषा विश्ववेदाः । स्वस्ति नस्ताक्ष्र्योऽअरिष्टनेमिः स्वस्ति नो बृहस्पतिर्दधातु ।। ॐ शान्तिः शान्तिः शान्तिः ।।",
            " ॐ नमस्ते गणपतये । त्वमेव प्रत्यक्षन् तत्त्वमसि । त्वमेव केवलङ् कर्ताऽसि । त्वमेव केवलन् धर्ताऽसि । त्वमेव केवलम् हर्ताऽसि । त्वमेव सर्वङ् खल्विदम् ब्रह्मासि । त्वं साक्षादात्माऽसि नित्यम् ।। १ ।।",
            " ऋतं वच्मि । सत्यं वच्मि ।। २ ।।",
            " अव त्वम् माम् । अव वक्तारम् । अव श्रोतारम् । अव दातारम् । अव धातारम् । अवानूचानमव शिष्यम् । अव पश्चात्तात् । अव पुरस्तात् । अवोत्तरात्तात् । अव दक्षिणात्तात् । अव चोध्र्वात्तात् । अवाधरात्तात् । सर्वतो माम् पाहि पाहि समन्तात् ।। ३ ।।",
            " त्वं वाङ्मयस्त्वञ् चिन्मयः । त्वम् आनन्दमयस्त्वम् ब्रह्ममयः । त्वं सच्चिदानन्दाद्वितीयोऽसि । त्वम् प्रत्यक्षम् ब्रह्मासि । त्वम् ज्ञानमयो विज्ञानमयोऽसि ।। ४ ।।",
            " सर्वञ् जगदिदन् त्वत्तो जायते । सर्वञ् जगदिदन् त्वत्तस्तिष्ठति । सर्वञ् जगदिदन् त्वयि लयमेष्यति । सर्वञ् जगदिदन् त्वयि प्रत्येति । त्वम् भूमिरापोऽनलोऽनिलो नभः । त्वञ् चत्वारि वाव्पदानि ।। ५ ।।",
            " त्वङ् गुणत्रयातीतः । (त्वम् अवस्थात्रयातीतः ।) त्वन् देहत्रयातीतः । त्वङ् कालत्रयातीतः । त्वम् मूलाधारस्थितोऽसि नित्यम् । त्वं शक्तित्रयात्मकः । त्वां योगिनो ध्यायन्ति नित्यम् । त्वम् ब्रह्मा त्वं विष्णुस्त्वम् रुद्रस्त्वम् इन्द्रस्त्वम् अग्निस्त्वं वायुस्त्वं सूर्यस्त्वञ चन्द्रमास्त्वम् ब्रह्मभूर्भुवः स्वरोम् ।। ६ ।।",
            " गणादिम् पूर्वमुच्चार्य वर्णादिन् तदनन्तरम् । अनुस्वारः परतरः । अर्धेन्दुलसितम् । तारेण ऋद्धम् । एतत्तव मनुस्वरूपम् । गकारः पूर्वरूपम् । अकारो मध्यमरूपम् । अनुस्वारश्चान्त्यरूपम् । बिन्दुरुत्तररूपम् । नादः सन्धानम् । संहिता सन्धिः । सैषा गणेशविद्या । गणक ऋषिः । निचृद्गायत्री छन्दः । गणपतिर्देवता । ॐ गँ गणपतये नमः ।। ७ ।।",
            " एकदन्ताय विद्महे । वक्रतुण्डाय धीमहि । तन्नो दन्तिः प्रचोदयात् ।। ८ ।।",
            " एकदन्तञ् चतुर्हस्तम् पाशमङ्कुशधारिणम् । रदञ् च वरदम् हस्तैर्बिभ्राणम् मूषकध्वजम् । रक्तं लम्बोदरं शूर्पकर्णकम् रक्तवाससम् । रक्तगन्धानुलिप्ताङ्गम् रक्तपुष्पैःसुपूजितम् । भक्तानुकम्पिनन् देवञ् जगत्कारणमच्युतम् । आविर्भूतञ् च सृष्ट्यादौ प्रकृतेः पुरुषात्परम् । एवन् ध्यायति यो नित्यं स योगी योगिनां वरः ।। ९ ।।",
            " नमो व्रातपतये नमो गणपतये| नमः प्रमथपतये | नमस्ते अस्तु लम्बोदराय एकदन्ताय | विघ्ननाशिने शिवसुताय | वरदमूर्तये नमः ।। १० ।।",
            " एतदथर्वशीर्षं योऽधीते । स ब्रह्मभूयाय कल्पते । स सर्वविघ्नैर्न बाध्यते । स सर्वतः सुखमेधते । स पञ्चमहापापात् प्रमुच्यते । सायमधीयानो दिवसकृतम् पापन् नाशयति । प्रातरधीयानो रात्रिकृतम् पापन् नाशयति । सायम् प्रातः प्रयुञ्जानोऽअपापो भवति । सर्वत्राधीयानोऽपविघ्नो भवति । धर्मार्थकाममोक्षञ् च विन्दति । इदम् अथर्वशीर्षम् अशिष्याय न देयम् । यो यदि मोहाद्दास्यति स पापीयान् भवति । सहस्रावर्तनात् । यं यङ् काममधीते तन् तमनेन साधयेत् ।। ११ ।।",
            " अनेन गणपतिमभिषिञ्चति । स वाग्मी भवति । चतुथ्र्यामनश्नन् जपत\ि\ स विद्यावान् भवति । इत्यथर्वणवाक्यम् । ब्रह्माद्यावरणम् विद्यात् । न बिभेति कदाचनेति ।। १२ ।।",
            " यो दूर्वाङ्कुरैर्यजति । स वैश्रवणोपमो भवति । यो लाजैर्यजति",
            " स यशोवान् भवति । स मेधावान् भवति । यो मोदकसहस्रेण यजति । स वाञ्छितफलमवाप्नोति । यः साज्यसमिद्भिर्यजति स सर्वं लभते स सर्वं लभते ।। १३ ।।",
            " अष्टौ ब्राह्मणान् सम्यग्ग्राहयित्वा | सूर्यवर्चस्वी भवति । सूर्यग्रहे महानद्याम् प्रतिमासन्निधौ | वा जप्त्वा सिद्धमन्त्रो भवति । महाविघ्नात् प्रमुच्यते । महादोषात् प्रमुच्यते । महापापात् प्रमुच्यते । स सर्वविद् भवति स सर्वविद् भवति । य एवम् वेद ।। १४ ।।",
            " इत्युपनिषत् । (शान्तिमन्त्राः) ॐ भद्रङ् कर्णेभिः शृणुयाम देवाः । भद्रम् पश्येमाक्षभिर्यजत्राः । स्थिरैरङ्गैस्तुष्टुवांसस्तनूभिः | व्यशेम देवहितं यदायुः ।।",
            " ॐ स्वस्ति न इन्द्रो वृद्धश्रवाः । स्वस्ति नः पूषा विश्ववेदाः । स्वस्ति नस्ताक्ष्र्योऽअरिष्टनेमिः | स्वस्ति नो बृहस्पतिर्दधातु ।। ॐ सहनाववतु । सहनौ भुनक्तु । सहवीर्यङ् करवावहै । तेजस्विनावधीतमस्तु मा विद्विषावहै ।। ॐ शान्तिः शान्तिः शान्तिः ।।"
          ]
    },
      ramraksha: {
        _id: "57d63ad3787783101bb9437e",
        name: "ramraksha",
        title: "श्रीरामरक्षा",
        shlok: [
          " ॥ श्रीरामरक्षास्तोत्रम्‌ ॥ श्रीगणेशायनम: । अस्य श्रीरामरक्षास्तोत्रमन्त्रस्य । बुधकौशिक ऋषि: । श्रीसीतारामचंद्रोदेवता । अनुष्टुप्‌ छन्द: । सीता शक्ति: । श्रीमद्‌हनुमान्‌ कीलकम्‌ । श्रीसीतारामचंद्रप्रीत्यर्थे जपे विनियोग: ॥",
          " ॥ अथ ध्यानम्‌ ॥ ध्यायेदाजानुबाहुं धृतशरधनुषं बद्दद्पद्‌मासनस्थं । पीतं वासोवसानं नवकमलदलस्पर्धिनेत्रं प्रसन्नम्‌ ॥ वामाङ्‌कारूढसीता मुखकमलमिलल्लोचनं नीरदाभं । नानालङ्‌कारदीप्तं दधतमुरुजटामण्डनं रामचंद्रम्‌ ॥",
          " ॥ इति ध्यानम्‌ ॥ चरितं रघुनाथस्य शतकोटिप्रविस्तरम्‌ । एकैकमक्षरं पुंसां महापातकनाशनम्‌ ॥१॥ ध्यात्वा नीलोत्पलश्यामं रामं राजीवलोचनम्‌ । जानकीलक्ष्मणॊपेतं जटामुकुटमण्डितम्‌ ॥२॥ ",
          " सासितूणधनुर्बाणपाणिं नक्तं चरान्तकम्‌ । स्वलीलया जगत्त्रातुमाविर्भूतमजं विभुम्‌ ॥३॥ रामरक्षां पठॆत्प्राज्ञ: पापघ्नीं सर्वकामदाम्‌ । शिरो मे राघव: पातु भालं दशरथात्मज: ॥४॥",
          " कौसल्येयो दृशौ पातु विश्वामित्रप्रिय: श्रुती । घ्राणं पातु मखत्राता मुखं सौमित्रिवत्सल: ॥५॥ जिव्हां विद्दानिधि: पातु कण्ठं भरतवंदित: । स्कन्धौ दिव्यायुध: पातु भुजौ भग्नेशकार्मुक: ॥६॥",
          " करौ सीतपति: पातु हृदयं जामदग्न्यजित्‌ । मध्यं पातु खरध्वंसी नाभिं जाम्बवदाश्रय: ॥७॥ सुग्रीवेश: कटी पातु सक्थिनी हनुमत्प्रभु: । ऊरू रघुत्तम: पातु रक्ष:कुलविनाशकृत्‌ ॥८॥",
          " जानुनी सेतुकृत्पातु जङ्‌घे दशमुखान्तक: । पादौ बिभीषणश्रीद: पातु रामोSखिलं वपु: ॥९॥ एतां रामबलोपेतां रक्षां य: सुकृती पठॆत्‌ । स चिरायु: सुखी पुत्री विजयी विनयी भवेत्‌ ॥१०॥",
          " पातालभूतलव्योम चारिणश्छद्‌मचारिण: । न द्र्ष्टुमपि शक्तास्ते रक्षितं रामनामभि: ॥११॥ रामेति रामभद्रेति रामचंद्रेति वा स्मरन्‌ । नरो न लिप्यते पापै भुक्तिं मुक्तिं च विन्दति ॥१२॥",
          " जगज्जेत्रैकमन्त्रेण रामनाम्नाभिरक्षितम्‌ । य: कण्ठे धारयेत्तस्य करस्था: सर्वसिद्द्दय: ॥१३॥ वज्रपंजरनामेदं यो रामकवचं स्मरेत्‌ । अव्याहताज्ञ: सर्वत्र लभते जयमंगलम्‌ ॥१४॥",
          " आदिष्टवान्‌ यथा स्वप्ने रामरक्षामिमां हर: । तथा लिखितवान्‌ प्रात: प्रबुद्धो बुधकौशिक: ॥१५॥ आराम: कल्पवृक्षाणां विराम: सकलापदाम्‌ । अभिरामस्त्रिलोकानां राम: श्रीमान्‌ स न: प्रभु: ॥१६॥",
          " तरुणौ रूपसंपन्नौ सुकुमारौ महाबलौ । पुण्डरीकविशालाक्षौ चीरकृष्णाजिनाम्बरौ ॥१७॥ फलमूलशिनौ दान्तौ तापसौ ब्रह्मचारिणौ । पुत्रौ दशरथस्यैतौ भ्रातरौ रामलक्ष्मणौ ॥१८॥",
          " शरण्यौ सर्वसत्वानां श्रेष्ठौ सर्वधनुष्मताम्‌ । रक्ष:कुलनिहन्तारौ त्रायेतां नो रघुत्तमौ ॥१९॥ आत्तसज्जधनुषा विषुस्पृशा वक्षया शुगनिषङ्‌ग सङि‌गनौ । रक्षणाय मम रामलक्ष्मणा वग्रत: पथि सदैव गच्छताम्‌ ॥२०॥",
          " संनद्ध: कवची खड्‌गी चापबाणधरो युवा । गच्छन्‌मनोरथोSस्माकं राम: पातु सलक्ष्मण: ॥२१॥ रामो दाशरथि: शूरो लक्ष्मणानुचरो बली । काकुत्स्थ: पुरुष: पूर्ण: कौसल्येयो रघुत्तम: ॥२२॥",
          " वेदान्तवेद्यो यज्ञेश: पुराणपुरुषोत्तम: । जानकीवल्लभ: श्रीमानप्रमेय पराक्रम: ॥२३॥ इत्येतानि जपेन्नित्यं मद्‌भक्त: श्रद्धयान्वित: । अश्वमेधायुतं पुण्यं संप्राप्नोति न संशय: ॥२४॥",
          " रामं दूर्वादलश्यामं पद्‌माक्षं पीतवाससम्‌ । स्तुवन्ति नामभिर्दिव्यैर्न ते संसारिणो नर: ॥२५॥ रामं लक्शमण पूर्वजं रघुवरं सीतापतिं सुंदरम्‌ । काकुत्स्थं करुणार्णवं गुणनिधिं विप्रप्रियं धार्मिकम्‌ | राजेन्द्रं सत्यसंधं दशरथनयं श्यामलं शान्तमूर्तिम्‌ । वन्दे लोकभिरामं रघुकुलतिलकं राघवं रावणारिम्‌ ॥२६॥",
          " रामाय रामभद्राय रामचंद्राय वेधसे । रघुनाथाय नाथाय सीताया: पतये नम: ॥२७॥ श्रीराम राम रघुनन्दन राम राम । श्रीराम राम भरताग्रज राम राम । श्रीराम राम रणकर्कश राम राम । श्रीराम राम शरणं भव राम राम ॥२८॥",
          " श्रीरामचन्द्रचरणौ मनसा स्मरामि । श्रीरामचन्द्रचरणौ वचसा गृणामि । श्रीरामचन्द्रचरणौ शिरसा नमामि । श्रीरामचन्द्रचरणौ शरणं प्रपद्ये ॥२९॥",
          " माता रामो मत्पिता रामचंन्द्र: । स्वामी रामो मत्सखा रामचंद्र: । सर्वस्वं मे रामचन्द्रो दयालु । नान्यं जाने नैव जाने न जाने ॥३०॥",
          " दक्षिणे लक्ष्मणो यस्य वामे तु जनकात्मजा । पुरतो मारुतिर्यस्य तं वन्दे रघुनंदनम्‌ ॥३१॥ लोकाभिरामं रनरङ्‌गधीरं राजीवनेत्रं रघुवंशनाथम्‌ । कारुण्यरूपं करुणाकरंतं श्रीरामचंद्रं शरणं प्रपद्ये ॥३२॥",
          " मनोजवं मारुततुल्यवेगं जितेन्द्रियं बुद्धिमतां वरिष्ठम्‌ । वातात्मजं वानरयूथमुख्यं श्रीरामदूतं शरणं प्रपद्ये ॥३३॥ कूजन्तं रामरामेति मधुरं मधुराक्षरम्‌ । आरुह्य कविताशाखां वन्दे वाल्मीकिकोकिलम्‌ ॥३४॥",
          " आपदामपहर्तारं दातारं सर्वसंपदाम्‌ । लोकाभिरामं श्रीरामं भूयो भूयो नमाम्यहम्‌ ॥३५॥ भर्जनं भवबीजानामर्जनं सुखसंपदाम्‌ । तर्जनं यमदूतानां रामरामेति गर्जनम्‌ ॥३६॥",
          " रामो राजमणि: सदा विजयते रामं रमेशं भजे । रामेणाभिहता निशाचरचमू रामाय तस्मै नम: । रामान्नास्ति परायणं परतरं रामस्य दासोSस्म्यहम्‌ । रामे चित्तलय: सदा भवतु मे भो राम मामुद्धर ॥३७॥",
          " राम रामेति रामेति रमे रामे मनोरमे । सहस्रनाम तत्तुल्यं रामनाम वरानने ॥३८॥ इति श्रीबुधकौशिकविरचितं श्रीरामरक्षास्तोत्रं संपूर्णम्‌ ॥ ॥ श्री सीतारामचंद्रार्पणमस्तु ॥"
        ]
    },
    maruti: {
      _id: "57d63b10787783101bb9437f",
      name: "maruti",
      title: "॥ मारुति स्तोत्र ॥",
      shlok: [
        "भीमरूपी महारुद्रा वज्र हनुमान मारुती । वनारी अन्जनीसूता रामदूता प्रभंजना ॥१॥ महाबळी प्राणदाता सकळां उठवी बळें । सौख्यकारी दुःखहारी (शोकहर्ता) (धूर्त) दूत वैष्णव गायका ॥२॥",
        " दीननाथा हरीरूपा सुंदरा जगदंतरा । पातालदेवताहंता भव्यसिंदूरलेपना ॥३॥ लोकनाथा जगन्नाथा प्राणनाथा पुरातना । पुण्यवंता पुण्यशीला पावना परितोषका ॥४॥",
        " ध्वजांगें उचली बाहो आवेशें लोटला पुढें । काळाग्नि काळरुद्राग्नि देखतां कांपती भयें ॥५॥ ब्रह्मांडें माइलीं नेणों आंवाळे दंतपंगती । नेत्राग्नी चालिल्या ज्वाळा भ्रुकुटी ताठिल्या बळें ॥६॥",
        " पुच्छ तें मुरडिलें माथां किरीटी कुंडलें बरीं । सुवर्ण कटि कांसोटी घंटा किंकिणि नागरा ॥७॥ ठकारे पर्वता ऐसा नेटका सडपातळू । चपळांग पाहतां मोठें महाविद्युल्लतेपरी ॥८॥",
        " कोटिच्या कोटि उड्डाणें झेंपावे उत्तरेकडे । मंदाद्रीसारखा द्रोणू क्रोधें उत्पाटिला बळें ॥९॥ आणिला मागुतीं नेला आला गेला मनोगती । मनासी टाकिलें मागें गतीसी तूळणा नसे ॥१०॥",
        " अणूपासोनि ब्रह्मांडाएवढा होत जातसे । तयासी तुळणा कोठें मेरु- मांदार धाकुटे ॥११॥ ब्रह्मांडाभोंवते वेढे वज्रपुच्छें करूं शके । तयासी तुळणा कैंची ब्रह्मांडीं पाहतां नसे ॥१२॥",
        " आरक्त देखिले डोळां ग्रासिलें सूर्यमंडळा । वाढतां वाढतां वाढे भेदिलें शून्यमंडळा ॥१३॥ धनधान्य पशुवृद्धि पुत्रपौत्र समग्रही । पावती रूपविद्यादि स्तोत्रपाठें करूनियां ॥१४॥",
        " भूतप्रेतसमंधादि रोगव्याधि समस्तही । नासती तुटती चिंता आनंदे भीमदर्शनें ॥१५॥ हे धरा पंधराश्लोकी लाभली शोभली बरी । दृढदेहो निःसंदेहो संख्या चंद्रकला गुणें ॥१६॥",
        " रामदासीं अग्रगण्यू कपिकुळासि मंडणू । रामरूपी अन्तरात्मा दर्शने दोष नासती ॥१७॥ ॥इति श्री रामदासकृतं संकटनिरसनं नाम ॥ ॥ श्री मारुतिस्तोत्रम् संपूर्णम् ॥"
      ]
    }
  }
  var imageCount = {
    haripath: 7,
    atharv: 9,
    ramraksha: 9,
    maruti:8
  }; 
  return {
    getShlokInfo: function(name) {
      var deferred = $q.defer();
      if (name in data) {

        deferred.resolve(true);
      } else {
        shlokService.getShlok(name).then(function success(res) {
          data[res.name] = res;
          deferred.resolve(true);
        });
      }
      return deferred.promise;
    },

    getShlok:function(name,number){
      if(name in data){
        return data[name].shlok[number-1];
      }
    },

    getTitle:function(name){
      if(name in data){
        return data[name].title;
      }
    },
    getNumberofShloks:function(name){
      if(name in data){
        return data[name].shlok.length;
      }
    },

    getImageCount: function(name) {
      return imageCount[name];
    }
  }
}]);
